'''
1.Дан список [1,2,3] Получить новый список удвоенный
'''
from math import floor

a = [1, 2, 3]
# b = [a[i] * 2 for i in range(len(a))]
b = [i*2 for i in a]
print(b)  # [2, 4, 6]

'''													
2. Дан список, возведите в квадрат каждый из элементов и получите сумму всех квадратов													
'''
a2 = [1, 2, 3]
b2 = 0
for i in a2:
    b2 += i ** 2
print(b2)

'''													
3. Он пьет 0,5 л воды в час, сколько выльет за 3, 6.7, 11.8 часов, округлить до меньшего													
'''
time1 = 3
v = [3, 6.7, 11.8]
# v_rez =[floor(i*0.5) for i in v]
v_rez = [int(i // 2) for i in v]  # результат - float   [1, 3.0, 5.0]
print(v_rez)

'''													
4. Дана стока, если есть пробел то преобразовать к верхнему рег если нету - то к нижнему													
'''
s = 'hello_world'
s1 = ''
if " " in s:
    s1 = s.upper()
else:
    s1 = s.lower()
print(s1)
